Revit 2026 API
AlphanumericRevisionSettings Methods
The AlphanumericRevisionSettings type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSequence |  Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Determines whether a specified AlphanumericRevisionSettings is the same as 'this'.
IsValid |  Determines whether the AlphanumericRevisionSettings object is in a valid state.
SetSequence
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace